
        --- System Configuration Dialog ---

Continue with configuration dialog? [yes/no]: no


Press RETURN to get started!



Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int f0/0
Router(config-if)#ip add 198.171.20.17 255.255.255.240
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up

Router(config-if)#exit
Router(config)#int s2/0
Router(config-if)#ip add 198.171.20.66 255.255.255.240
Router(config-if)#no shut

Router(config-if)#
%LINK-5-CHANGED: Interface Serial2/0, changed state to up

Router(config-if)#exit
Router(config)#int 
%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial2/0, changed state to up

% Incomplete command.
Router(config)#int s3/0
Router(config-if)#ip add 198.171.20.81 255.255.255.240
Router(config-if)#clock rate 64000
Router(config-if)#no shut

%LINK-5-CHANGED: Interface Serial3/0, changed state to down
Router(config-if)#exit
Router(config)#
%LINK-5-CHANGED: Interface Serial3/0, changed state to up

%LINEPROTO-5-UPDOWN: Line protocol on Interface Serial3/0, changed state to up




Router con0 is now available



Press RETURN to get started.





Router>en
Router#config t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 198.171.20.0 255.255.255.240 198.171.20.65
Router(config)#ip route 198.171.20.32 255.255.255.240 198.171.20.82
Router(config)#ip route 198.171.20.96 255.255.255.240 198.171.20.82
Router(config)#ip route 198.171.20.48 255.255.255.240 198.171.20.82
Router(config)#exit
Router#
%SYS-5-CONFIG_I: Configured from console by console

Router#show ip route
Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
       D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
       N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
       E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
       i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
       * - candidate default, U - per-user static route, o - ODR
       P - periodic downloaded static route

Gateway of last resort is not set

     198.171.20.0/28 is subnetted, 7 subnets
S       198.171.20.0 [1/0] via 198.171.20.65
C       198.171.20.16 is directly connected, FastEthernet0/0
S       198.171.20.32 [1/0] via 198.171.20.82
S       198.171.20.48 [1/0] via 198.171.20.82
C       198.171.20.64 is directly connected, Serial2/0
C       198.171.20.80 is directly connected, Serial3/0
S       198.171.20.96 [1/0] via 198.171.20.82
Router#

Press RETURN to get started.

